** Rotation Representation

#+BEGIN_SRC jupyter-python :session drone-kinematics
import sympy as sp
from galgebra.ga import Ga
from sympy import symbols,sin,cos,sqrt
from galgebra.printer import Eprint

Eprint()

x,y,z = sp.symbols('x y z')
(o3d,ex,ey,ez) = Ga.build('e*x|y|z',g=[1,1,1])
#+END_SRC


#+BEGIN_SRC jupyter-python :session drone-kinematics
print(o3d.mv('S', 'scalar'))
print(o3d.mv('V', 'vector'))
print(o3d.mv('B', 'bivector'))
print(o3d.mv('I', 'pseudo'))

#+END_SRC

#+RESULTS:
: S
: V__x[0m*[0;34me_x[0m + V__y[0m*[0;34me_y[0m + V__z[0m*[0;34me_z[0m
: B__x[0my[0m*[0;34me_x[0m^[0;34me_y[0m + B__x[0mz[0m*[0;34me_x[0m^[0;34me_z[0m + B__y[0mz[0m*[0;34me_y[0m^[0;34me_z[0m
: I__x[0my[0mz[0m*[0;34me_x[0m^[0;34me_y[0m^[0;34me_z[0m


** COMMENT AHRS kinematic model

The Euler angles describe the aircraft body-axis orientation in north, east, and down coordinates.
That means in longitudinal, lateral and normal coordinates, with respect to the local tangent plane to the Earth and true north.
Here \theta is the pitch angle, \phi the roll  angle  and \psi is the yaw angle  according to Figure 2.
The angular velocity vector expressed in body frame is P for  the  roll  rate, Q is  the  pitch  rate  and R is  the  yaw rate; and it is related to the Earth frame by the transformation given by the kinematics equation (1).

SymPy mechanics module

#+BEGIN_SRC jupyter-python :session kinematic_model
import sympy as sp
from sympy.abc import theta, psi, phi
from sympy.physics.mechanics import dynamicsymbols
from sympy.physics.vector import ReferenceFrame, CoordinateSym

# Global Time coordinate
t = sp.Symbol('t')
B = ReferenceFrame('$B$') # Body frame
E = ReferenceFrame('$E$') # Earth frame


# Defined in body frame
roll_rate_b, pitch_rate_b, yaw_rate_b = dynamicsymbols("P Q R", real=True)

# Euler angles defined in earth frame
roll_angle_e = dynamicsymbols("$\phi$", real=True)
pitch_angle_e = dynamicsymbols("$\theta$", real=True)
yaw_angle_e = dynamicsymbols("$\psi$", real=True)
dt_roll_angle_e = roll_angle_e.diff(t)
dt_pitch_angle_e = pitch_angle_e.diff(t)
dt_yaw_angle_e = yaw_angle_e.diff(t)



angular_velocity = sp.Matrix([[roll_rate_b],
                              [pitch_rate_b],
                              [yaw_rate_b]])
dt_euler = sp.Matrix([[dt_roll_rate_e],
                      [dt_pitch_rate_e],
                      [dt_yaw_rate_e]])

kinematics_transformation_matrix = sp.Matrix([[1,
                                               sp.tan(pitch_angle_e)*sp.sin(roll_angle_e),
                                               sp.tan(pitch_angle_e)*sp.sin(roll_angle_e)],
                                              [0, sp.cos(roll_angle_e), -sp.sin(roll_angle_e)],
                                              [0,
                                               sp.sin(roll_angle_e)/sp.cos(pitch_angle_e),
                                               sp.cos(roll_angle_e)/sp.cos(pitch_angle_e)]])

kinematics_transformation_matrix*angular_velocity - dt_euler
#+END_SRC

#+RESULTS:
:RESULTS:
# [goto error]
:
: AttributeErrorTraceback (most recent call last)
: <ipython-input-2-028009470547> in <module>
:      14 yaw_angle_e = dynamicsymbols("$\psi$", real=True)
:      15 dt_roll_angle_e = roll_angle_e.diff(t)
: ---> 16 dt_pitch_angle_e = pitch_angle_e.diff(t)
:      17 dt_yaw_angle_e = yaw_angle_e.diff(t)
:      18
:
: AttributeError: 'list' object has no attribute 'diff'
:END:

* Deriving state equations
https://dial.uclouvain.be/memoire/ucl/en/object/thesis%3A12954/datastream/PDF_01/view

https://arxiv.org/pdf/1708.06652.pdf



#+BEGIN_SRC jupyter-python :session equation :results raw
from sympy import symbols
from galgebra.ga import Ga

from galgebra.printer import Format
Format(Fmode = False, Dmode = True)

st4coords = (t,x,y,z) = symbols('t x y z', real=True)
st4 = Ga('e',
         g=[1,-1,-1,-1],
         coords=st4coords)

M = st4.mv('M','mv',f = True)

M.grade(3).Fmt(3,r'\langle \mathbf{M} \rangle _3')

#+END_SRC

#+RESULTS:
:RESULTS:
 \begin{align*}   \langle \mathbf{M} \rangle _3 =& M^{txy} {\left (t,x,y,z \right )} \boldsymbol{e}_{t}\wedge \boldsymbol{e}_{x}\wedge \boldsymbol{e}_{y} \\  &  + M^{txz} {\left (t,x,y,z \right )} \boldsymbol{e}_{t}\wedge \boldsymbol{e}_{x}\wedge \boldsymbol{e}_{z} \\  &  + M^{tyz} {\left (t,x,y,z \right )} \boldsymbol{e}_{t}\wedge \boldsymbol{e}_{y}\wedge \boldsymbol{e}_{z} \\  &  + M^{xyz} {\left (t,x,y,z \right )} \boldsymbol{e}_{x}\wedge \boldsymbol{e}_{y}\wedge \boldsymbol{e}_{z}  \end{align*}
:END:

#


